build/docs/realization-plan/exp-as-narrative.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Plan to realize experiment as a narrative</title>
<!-- 2019-04-09 Tue 14:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../style/css/bootstrap.mini.css"/>
<link rel="stylesheet" type="text/css" href="../style/css/labtheme.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Plan to realize experiment as a narrative</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document provides the plan for realization of
experiment as a narrative.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Milestone Snapshot</h2>
<div class="outline-text-2" id="text-2">
<p>
Each milestone has different tasks.  To get the experiment
working in the new format, it is not mandatory that all
the tasks within each milestone are completed.  The
building of the new experiment framework is iterative
while in each iteration, certain tasks from each of the
milestone are completed. 
</p>
<table id="milestone-snapshot" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> A snapshot of milestones</caption>

<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">S.</th>
<th scope="col" class="left">Req</th>
<th scope="col" class="left">Milestone</th>
<th scope="col" class="left">Plan</th>
<th scope="col" class="left">Status</th>
<th scope="col" class="left">Est</th>
<th scope="col" class="left">Act</th>
<th scope="col" class="left">Issues</th>
</tr>

<tr>
<th scope="col" class="right">no</th>
<th scope="col" class="left">Map</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">hrs</th>
<th scope="col" class="left">hrs</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1.</td>
<td class="left">&#xa0;</td>
<td class="left"><a href="#sec-3-1">Convert the content to Org</a></td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/milestones/1">ref</a></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">2.</td>
<td class="left">&#xa0;</td>
<td class="left"><a href="#sec-3-2">Provide components as a service</a></td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/milestones/2">ref</a></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">3.</td>
<td class="left">&#xa0;</td>
<td class="left"><i>Build the experiment interface</i></td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/milestones/3">ref</a></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">4.</td>
<td class="left">&#xa0;</td>
<td class="left"><i>Experiment Weaving</i></td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/milestones/4">ref</a></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Total</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Detailed Plan</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Convert the content to Org</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The content is written in a series of HTML files.  This
content is to be convertd to org - a lightweight markup
language as a narrative of the experiment.
</p>

<table id="rlz-plan-convert-to-org" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Realization Plan for Conversion to Org</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">S.</th>
<th scope="col" class="left">Tasks</th>
<th scope="col" class="left">Issue</th>
<th scope="col" class="left">Expected</th>
<th scope="col" class="left">Actual</th>
<th scope="col" class="left">Estimated</th>
<th scope="col" class="left">Actual</th>
<th scope="col" class="left">Status</th>
<th scope="col" class="left">Assignee</th>
</tr>

<tr>
<th scope="col" class="left">NO</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Effort</th>
<th scope="col" class="left">Effort</th>
<th scope="col" class="left">Start,</th>
<th scope="col" class="left">Start/</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(in</th>
<th scope="col" class="left">(in</th>
<th scope="col" class="left">End</th>
<th scope="col" class="left">End</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">person</th>
<th scope="col" class="left">person</th>
<th scope="col" class="left">Dates</th>
<th scope="col" class="left">Dates</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">hours)</th>
<th scope="col" class="left">hours)</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">1.</td>
<td class="left">Convert each screen</td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/issues/2">issue</a></td>
<td class="left">16</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Thirumal</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">to an org file.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Total</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">16</td>
<td class="left">0</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
