src/realization-plan/exp-as-narrative.org
** Provide components as a service
   Right now each page of merge sort is interspersed with
   code snippets.  These code snippets allow creation of an
   array, split of an array, merge of an array etc.  These
   various operations are taken out of the current
   experiment and provided as a service.
#+caption:  Realization Plan for components as service
#+name: rlz-plan-components
|---+-------+----------------------------+-------+----------+--------+-----------+--------+--------+----------+---|
|   | S.    | Tasks                      | Issue | Expected | Actual | Estimated | Actual | Status | Assignee |   |
|   | NO    |                            |       | Effort   | Effort | Start,    | Start/ |        |          |   |
|   |       |                            |       | (in      | (in    | End       | End    |        |          |   |
|   |       |                            |       | person   | person | Dates     | Dates  |        |          |   |
|   |       |                            |       | hours)   | hours) |           |        |        |          |   |
|---+-------+----------------------------+-------+----------+--------+-----------+--------+--------+----------+---|
|   | 1.    | Remove the code snippets   | [[https://gitlab.com/vxcg/res/cse/data-structures/mergesort/issues/4][issue]] | 40       |        |           |        |        | Thirumal |   |
|   |       | and build them separately. |       |          |        |           |        |        |          |   |
|---+-------+----------------------------+-------+----------+--------+-----------+--------+--------+----------+---|
|   | Total |                            |       | 40       | 0      |           |        |        |          |   |
| ^ |       |                            |       | est      | act    |           |        |        |          |   |
|---+-------+----------------------------+-------+----------+--------+-----------+--------+--------+----------+---|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** Build experiment interface
   A narrative of an experiment written in a markup
   language, in this case org, is built, an experiment theme
   is applied that provides a new experiment interface.

#+caption:  Realization Plan for Experiment Interface
#+name: rlz-plan-exp-interface
|---+-------+------------------+-------+----------+--------+-----------+--------+--------+----------+---|
|   | S.    | Tasks            | Issue | Expected | Actual | Estimated | Actual | Status | Assignee |   |
|   | NO    |                  |       | Effort   | Effort | Start,    | Start/ |        |          |   |
|   |       |                  |       | (in      | (in    | End       | End    |        |          |   |
|   |       |                  |       | person   | person | Dates     | Dates  |        |          |   |
|   |       |                  |       | hours)   | hours) |           |        |        |          |   |
|---+-------+------------------+-------+----------+--------+-----------+--------+--------+----------+---|
|   | 1.    | Build a theme    | [[https://gitlab.com/vxcg/res/cse/data-structures/mergesort/issues/3][issue]] | 40       |        |           |        |        | Thirumal |   |
|   |       | for a three pane |       |          |        |           |        |        |          |   |
|   |       | interface.       |       |          |        |           |        |        |          |   |
|---+-------+------------------+-------+----------+--------+-----------+--------+--------+----------+---|
|   | Total |                  |       | 40       | 0      |           |        |        |          |   |
| ^ |       |                  |       | est      | act    |           |        |        |          |   |
|---+-------+------------------+-------+----------+--------+-----------+--------+--------+----------+---|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

