build/docs/realization-plan/exp-as-narrative.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Provide components as a service</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Right now each page of merge sort is interspersed with
code snippets.  These code snippets allow creation of an
array, split of an array, merge of an array etc.  These
various operations are taken out of the current
experiment and provided as a service.
</p>
<table id="rlz-plan-components" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Realization Plan for components as service</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">S.</th>
<th scope="col" class="left">Tasks</th>
<th scope="col" class="left">Issue</th>
<th scope="col" class="left">Expected</th>
<th scope="col" class="left">Actual</th>
<th scope="col" class="left">Estimated</th>
<th scope="col" class="left">Actual</th>
<th scope="col" class="left">Status</th>
<th scope="col" class="left">Assignee</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">NO</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Effort</th>
<th scope="col" class="left">Effort</th>
<th scope="col" class="left">Start,</th>
<th scope="col" class="left">Start/</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(in</th>
<th scope="col" class="left">(in</th>
<th scope="col" class="left">End</th>
<th scope="col" class="left">End</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">person</th>
<th scope="col" class="left">person</th>
<th scope="col" class="left">Dates</th>
<th scope="col" class="left">Dates</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">hours)</th>
<th scope="col" class="left">hours)</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">1.</td>
<td class="left">Remove the code snippets</td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/issues/4">issue</a></td>
<td class="left">40</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Thirumal</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">and build them separately.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Total</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">40</td>
<td class="left">0</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Build experiment interface</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A narrative of an experiment written in a markup
language, in this case org, is built, an experiment theme
is applied that provides a new experiment interface.
</p>

<table id="rlz-plan-exp-interface" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Realization Plan for Experiment Interface</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">S.</th>
<th scope="col" class="left">Tasks</th>
<th scope="col" class="left">Issue</th>
<th scope="col" class="left">Expected</th>
<th scope="col" class="left">Actual</th>
<th scope="col" class="left">Estimated</th>
<th scope="col" class="left">Actual</th>
<th scope="col" class="left">Status</th>
<th scope="col" class="left">Assignee</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">NO</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Effort</th>
<th scope="col" class="left">Effort</th>
<th scope="col" class="left">Start,</th>
<th scope="col" class="left">Start/</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(in</th>
<th scope="col" class="left">(in</th>
<th scope="col" class="left">End</th>
<th scope="col" class="left">End</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">person</th>
<th scope="col" class="left">person</th>
<th scope="col" class="left">Dates</th>
<th scope="col" class="left">Dates</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">hours)</th>
<th scope="col" class="left">hours)</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">1.</td>
<td class="left">Build a theme</td>
<td class="left"><a href="https://gitlab.com/vxcg/res/cse/data-structures/mergesort/issues/3">issue</a></td>
<td class="left">40</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Thirumal</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">for a three pane</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">interface.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Total</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">40</td>
<td class="left">0</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
