src/realization-plan/exp-as-narrative.org
** Experiment Construction
   There is the narrative, the components as service, and
   the new theme.  Build a mechanism to weave these three
   things together to enable easy authoring and a consistent
   presentation.
#+caption:  Realization Plan for Experiment construction
#+name: rlz-plan-exp-cons
|---+-------+---------------------+-------+----------+--------+-----------+--------+--------+----------|
|   | S.    | Tasks               | Issue | Expected | Actual | Estimated | Actual | Status | Assignee |
|   | NO    |                     |       | Effort   | Effort | Start,    | Start/ |        |          |
|   |       |                     |       | (in      | (in    | End       | End    |        |          |
|   |       |                     |       | person   | person | Dates     | Dates  |        |          |
|   |       |                     |       | hours)   | hours) |           |        |        |          |
|---+-------+---------------------+-------+----------+--------+-----------+--------+--------+----------|
|   | 1.    | Statically bind the | [[https://gitlab.com/vxcg/res/cse/data-structures/mergesort/issues/6][issue]] | 16       |        |           |        |        | Thirumal |
|   |       | location of the     |       |          |        |           |        |        |          |
|   |       | resources.          |       |          |        |           |        |        |          |
|---+-------+---------------------+-------+----------+--------+-----------+--------+--------+----------|
|   | 2.    |                     |       |          |        |           |        |        |          |
|---+-------+---------------------+-------+----------+--------+-----------+--------+--------+----------|
|   | Total |                     |       | 16       | 0      |           |        |        |          |
| ^ |       |                     |       | est      | act    |           |        |        |          |
|---+-------+---------------------+-------+----------+--------+-----------+--------+--------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)
